app/views/books/show.html.erb

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 5]]
---
                <i class="fa fa-heart" aria-hidden="true" style="color: red;"></i>
                <%= @book.favorites.count %> いいね

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 5]]
---
                <i class="fa fa-heart-o" aria-hidden="true"></i>
                <%= @book.favorites.count %> いいね

SELECT "post_comments".* FROM "post_comments" WHERE "post_comments"."book_id" = ?  [["book_id", 5]]
---
          <ol style="margin: 5px">
            <% @book.post_comments.each do |post_comment| %>