app/controllers/books_controller.rb

  def create
    @post_book = Book.new(post_book_params)
    @post_book.user_id = current_user.id
    if @post_book.save
---
INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "タイトル"], ["body", "オピニオン"], ["user_id", 1], ["created_at", "2020-10-22 08:16:00.713476"], ["updated_at", "2020-10-22 08:16:00.713476"]]

  def index
    @post_book = Book.new
    @post_books = Book.all
---
SELECT "books".* FROM "books"