app/controllers/post_comments_controller.rb

  def create
    @comment = PostComment.new(post_comment_params)
    @comment.user_id = current_user.id
    @book = Book.find(params[:book_id])
    @comment.book_id = @book.id
    @comment.save
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
INSERT INTO "post_comments" ("comment", "user_id", "book_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["comment", "この本読んだ"], ["user_id", 1], ["book_id", 5], ["created_at", "2020-10-24 03:17:10.130782"], ["updated_at", "2020-10-24 03:17:10.130782"]]

  def destroy
    @book = Book.find(params[:book_id])
    @comment = PostComment.find(params[:id])
    @comment.destroy
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
SELECT  "post_comments".* FROM "post_comments" WHERE "post_comments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "post_comments" WHERE "post_comments"."id" = ?  [["id", 1]]