app/controllers/relationships_controller.rb

  def create
    follow = current_user.active_relationships.build(follower_id: params[:user_id])
    follow.save
    @user = User.find(params[:relationship][:following_id])
---
INSERT INTO "relationships" ("following_id", "follower_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["following_id", 2], ["follower_id", 1], ["created_at", "2020-10-29 03:21:52.074972"], ["updated_at", "2020-10-29 03:21:52.074972"]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]