app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "books".* FROM "books" WHERE "books"."user_id" = ?  [["user_id", 1]]
---
  def show
    @user = User.find(params[:id])
    @post_book = Book.new
    @books = @user.books
    @post_books = Book.all

SELECT "users".* FROM "users"
---
  def index
    @user = current_user
    @userss = User.all

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "profile_image_id" = ?, "introduction" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["profile_image_id", "522f130ce23246d70e40d20e77e4963fdb00b1e8ca9b1279141f9af7d7b3"], ["introduction", ""], ["updated_at", "2020-10-22 08:16:19.539904"], ["id", 1]]
---
  def update
    @user = User.find(params[:id])
    if @user.update(user_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def follows
    user = User.find(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def followers
    user = User.find(params[:id])

SELECT "users".* FROM "users" WHERE (name LIKE '%yohei%')
---
  def search
    if params[:name].present?
      @users = User.where('name LIKE ?', "%#{params[:name]}%")